; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v13 ?v6)
             (pred_6 ?v2 ?v7)
             (pred_2 ?v13 ?v7)
             (pred_7 ?v10 ?v13 )
	     (pred_8 ?v13)
             (pred_12 ?v4)
             (pred_1 ?v2)
             (pred_10 ?v7)
             (pred_9 ?v13)
             (pred_11 ?v2)
             (pred_5 ?v13)
             (pred_3 ))



(:action op_4
:parameters (?v1 ?v3 ?v9 ?v11)
:precondition (and (pred_12 ?v1) (pred_12 ?v3) (pred_1 ?v9) (pred_10 ?v11)
          (pred_4 ?v1 ?v3) (pred_6 ?v9 ?v11)
                   (pred_2 ?v3 ?v11) (pred_8 ?v1) 
                   (pred_9 ?v3) (pred_11 ?v9))
:effect (and  (pred_5 ?v3) (not (pred_9 ?v3))))


(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_12 ?v1) (pred_12 ?v8)
               (pred_8 ?v1) (pred_4 ?v1 ?v8) (pred_5 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v1))))

(:action op_2
:parameters (?v1 ?v9)
:precondition (and (pred_12 ?v1) (pred_1 ?v9) 
                  (pred_8 ?v1) (pred_7 ?v9 ?v1) (pred_3 ))
:effect (and (pred_11 ?v9)
   (not (pred_7 ?v9 ?v1)) (not (pred_3 ))))


(:action op_5
:parameters (?v1 ?v5 ?v12)
:precondition (and (pred_12 ?v1) (pred_1 ?v5) (pred_1 ?v12)
                  (pred_8 ?v1) (pred_11 ?v12) (pred_7 ?v5 ?v1))
:effect (and (pred_11 ?v5) (pred_7 ?v12 ?v1)
        (not (pred_11 ?v12)) (not (pred_7 ?v5 ?v1))))

(:action op_1
:parameters (?v1 ?v9)
:precondition (and (pred_12 ?v1) (pred_1 ?v9) 
                  (pred_8 ?v1) (pred_11 ?v9))
:effect (and (pred_3 ) (pred_7 ?v9 ?v1) (not (pred_11 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_14 obj_07 obj_01 obj_03 obj_02 obj_18 obj_16 obj_10 obj_05 obj_06 obj_15 obj_20 obj_09 obj_04 obj_13
    obj_17 obj_21 obj_11
    obj_08 obj_22 obj_19
    )

    (:init
       (pred_3)

       (pred_12 obj_12)
       (pred_12 obj_14)
       (pred_12 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_16)
       (pred_12 obj_10)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_13)
       (pred_10 obj_17)
       (pred_10 obj_21)
       (pred_10 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_22)
       (pred_1 obj_19)

       (pred_4 obj_12 obj_03)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_07)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_14)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_02 obj_05)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_07)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_10 obj_05)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_02)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_13 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_2  obj_20 obj_17)
       (pred_2  obj_10 obj_21)
       (pred_2  obj_15 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_04)
       (pred_5 obj_13)

       (pred_6  obj_08 obj_17)
       (pred_6  obj_22 obj_21)
       (pred_6  obj_19 obj_11)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_22 obj_13)
       (pred_7 obj_19 obj_13)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_7 obj_08 obj_12)
       (pred_7 obj_22 obj_09)
    ))
(:constraints
  (always (not (pred_8 obj_14)))
)
)

; plan
1. (op_3 obj_16 obj_18)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_06)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_06)
   goals met: 0 of 2
3. (op_3 obj_06 obj_04)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_04)
   goals met: 0 of 2
4. (op_3 obj_04 obj_13)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_13)
   goals met: 0 of 2
5. (op_2 obj_13 obj_22)
   deleted: (pred_7 obj_22 obj_13) (pred_3)
   added: (pred_11 obj_22)
   goals met: 0 of 2
6. (op_3 obj_13 obj_04)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_3 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 2
8. (op_1 obj_09 obj_22)
   deleted: (pred_11 obj_22)
   added: (pred_3) (pred_7 obj_22 obj_09)
   goals met: 1 of 2
9. (op_3 obj_09 obj_04)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_04)
   goals met: 1 of 2
10. (op_3 obj_04 obj_06)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_06)
   goals met: 1 of 2
11. (op_3 obj_06 obj_18)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_18)
   goals met: 1 of 2
12. (op_3 obj_18 obj_07)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_07)
   goals met: 1 of 2
13. (op_2 obj_07 obj_08)
   deleted: (pred_7 obj_08 obj_07) (pred_3)
   added: (pred_11 obj_08)
   goals met: 1 of 2
14. (op_3 obj_07 obj_18)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_18)
   goals met: 1 of 2
15. (op_3 obj_18 obj_02)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_02)
   goals met: 1 of 2
16. (op_3 obj_02 obj_03)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_03)
   goals met: 1 of 2
17. (op_3 obj_03 obj_12)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_12)
   goals met: 1 of 2
18. (op_1 obj_12 obj_08)
   deleted: (pred_11 obj_08)
   added: (pred_3) (pred_7 obj_08 obj_12)
   goals met: 2 of 2
